Revit 2025 API
WoodPoreType Enumeration
 The enumerated type representing the permitted values for the asset property "WoodPoreType" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WoodPoreType
Public Enumeration WoodPoreType
public enum class WoodPoreType
type WoodPoreType
Members
Member name | Value | Description
InBothWoods | 0
EarlywoodOnly | 1
LatewoodOnly | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace